Revit 2026 API

# TileTileBrickColor Property

---

The property labeled "Tile Color" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileBrickColor { get; }
```
```vb
Public Shared ReadOnly Property TileBrickColor As String
	Get
```
```cpp
public:
static property String^ TileBrickColor {
	String^ get ();
}
```
```fsharp
static member TileBrickColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace